INSERT INTO restaurants (id, name, description, created_at) VALUES 
('00000000-0000-0000-0000-000000000001', 'Пиццерия у Тома', 'Готовим настоящую итальянскую пиццу в дровяной печи.', CURRENT_TIMESTAMP),
('00000000-0000-0000-0000-000000000002', 'Суши Мастер', 'Свежие роллы, суши и поке с быстрой доставкой.', CURRENT_TIMESTAMP),
('00000000-0000-0000-0000-000000000003', 'Burger Corner', 'Сочные бургеры с мраморной говядиной и хрустящая картошка фри.', CURRENT_TIMESTAMP),
('00000000-0000-0000-0000-000000000004', 'Wok & Roll', 'Азиатская лапша в коробочках и ароматные супы том ям.', CURRENT_TIMESTAMP),
('00000000-0000-0000-0000-000000000005', 'Зеленый Лист', 'Полезная еда, вегетарианские боулы и дефенс-смузи.', CURRENT_TIMESTAMP)
ON CONFLICT (id) DO NOTHING;

INSERT INTO menu_items (id, restaurant_id, name, price, is_available) VALUES 
('11111111-1111-1111-1111-111111111101', '00000000-0000-0000-0000-000000000001', 'Пицца Пепперони', 55000, true),
('11111111-1111-1111-1111-111111111102', '00000000-0000-0000-0000-000000000001', 'Пицца Четыре сыра', 60000, true),
('11111111-1111-1111-1111-111111111103', '00000000-0000-0000-0000-000000000001', 'Чесночный соус', 5000, true),

('22222222-2222-2222-2222-222222222201', '00000000-0000-0000-0000-000000000002', 'Филадельфия Классик', 75000, true),
('22222222-2222-2222-2222-222222222202', '00000000-0000-0000-0000-000000000002', 'Калифорния с лососем', 68000, true),
('22222222-2222-2222-2222-222222222203', '00000000-0000-0000-0000-000000000002', 'Мисо суп', 25000, true),

('33333333-3333-3333-3333-333333333301', '00000000-0000-0000-0000-000000000003', 'Двойной Чизбургер', 49000, true),
('33333333-3333-3333-3333-333333333302', '00000000-0000-0000-0000-000000000003', 'Картошка Фри', 19000, true), 
('33333333-3333-3333-3333-333333333303', '00000000-0000-0000-0000-000000000003', 'Картошка по-деревенски', 22000, true),

('44444444-4444-4444-4444-444444444401', '00000000-0000-0000-0000-000000000004', 'Вок с курицей и терияки', 45000, true),
('44444444-4444-4444-4444-444444444402', '00000000-0000-0000-0000-000000000004', 'Суп Том Ям с креветками', 59000, true),

('55555555-5555-5555-5555-555555555501', '00000000-0000-0000-0000-000000000005', 'Зеленый боул с авокадо и тофу', 52000, true),
('55555555-5555-5555-5555-555555555502', '00000000-0000-0000-0000-000000000005', 'Детокс смузи шпинат-яблоко', 28000, true)
ON CONFLICT (id) DO NOTHING;

INSERT INTO users (id, email, password_hash) VALUES 
('aaaaaaaa-aaaa-aaaa-aaaa-aaaaaaaaaaaa', 'test@example.com', '$2a$10$N9qo8uLOickgx2ZMRZoMyeIjZAgcfl7p92ldGxad68LJZdL17lhWy')
ON CONFLICT (id) DO NOTHING;